rheoTool/tutorials/rheoHeatFoam/cylinder/PowerLaw/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom mesh;
sourceCase "$FOAM_CASE";
sourcePatches (walls);

flipNormals false;

extrudeModel        linearDirection;

nLayers             30;
expansionRatio      1.01;

linearDirectionCoeffs
{
    axisPt          (0 0 0);
    direction       (0 1 0);
    thickness       2;
}

mergeFaces false;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
